# Cityes.py
# Сопоставление кода страны с локалью для Faker
country_locales = {
    'ES': 'es_ES',
    'DE': 'de_DE',
    'FR': 'fr_FR',
    'GB': 'en_GB',
    'PL': 'pl_PL',
    'NL': 'nl_NL',
    'AT': 'de_AT',
    'DK': 'da_DK',
    'UA': 'uk_UA',
    'RO': 'ro_RO',
    'EE': 'et_EE',
    'LV': 'lv_LV',
    'LT': 'lt_LT',
    'BG': 'bg_BG',
}

# Сопоставление кода страны с названием страны
country_names = {
    'ES': 'Spain',
    'DE': 'Germany',
    'FR': 'France',
    'GB': 'United Kingdom',
    'PL': 'Poland',
    'NL': 'Netherlands',
    'AT': 'Austria',
    'DK': 'Denmark',
    'UA': 'Ukraine',
    'RO': 'Romania',
    'EE': 'Estonia',
    'LV': 'Latvia',
    'LT': 'Lithuania',
    'BG': 'Bulgaria',
}

city_coordinates = {
    'ES': [
        '40.416775,-3.703790',  # Madrid
        '41.385064,2.173403',  # Barcelona
        '37.389092,-5.984459',  # Seville
        '39.469907,-0.376288',  # Valencia
        '36.721274,-4.421399',  # Malaga
        '40.970104,-5.663540',  # Salamanca
        '38.707750,-9.136591',  # Lisbon
        '42.237964,-8.720244',  # Vigo
        '37.992240,-1.130654',  # Murcia
        '39.569600,2.650160',  # Palma
        '40.656635,-4.697438',  # Ávila
        '40.331950,-1.107018',  # Teruel
        '41.656060,-0.877340'  # Zaragoza
    ],
    'DE': [
        '52.520008,13.404954',  # Berlin
        '48.135124,11.581981',  # Munich
        '50.110924,8.682127',  # Frankfurt
        '53.551086,9.993682',  # Hamburg
        '51.227741,6.773456',  # Dusseldorf
        '51.514942,7.466963',  # Dortmund
        '49.006889,8.403653',  # Karlsruhe
        '49.452103,11.076665',  # Nuremberg
        '51.339695,12.373075',  # Leipzig
        '49.791304,9.953354',  # Würzburg
        '50.775346,6.083887',  # Aachen
        '50.641200,10.121810',  # Eisenach
        '50.828710,8.773710'  # Marburg
    ],
    'FR': [
        '48.856613,2.352222',  # Paris
        '43.296482,5.369780',  # Marseille
        '45.764043,4.835659',  # Lyon
        '44.837789,-0.579180',  # Bordeaux
        '43.610769,3.876716',  # Montpellier
        '47.394144,0.684840',  # Tours
        '47.322047,5.041480',  # Dijon
        '47.083354,2.398712',  # Bourges
        '49.258329,4.031696',  # Reims
        '47.237829,6.024053',  # Besançon
        '48.117267,-1.677793',  # Rennes
        '46.204390,5.228800',  # Bourg-en-Bresse
        '46.580224,0.340375'  # Poitiers
    ],
    'GB': [
        '51.507351,-0.127758',  # London
        '53.483959,-2.244644',  # Manchester
        '55.953251,-3.188267',  # Edinburgh
        '52.486244,-1.890401',  # Birmingham
        '51.454513,-2.587910',  # Bristol
        '52.205337,0.121817',  # Cambridge
        '53.800755,-1.549077',  # Leeds
        '52.629729,-1.294835',  # Leicester
        '53.408371,-2.991573',  # Liverpool
        '50.375456,-4.142656',  # Plymouth
        '53.228378,-0.549716',  # Lincoln
        '53.683299,-1.497681',  # Wakefield
        '52.634772,-1.694506'  # Nuneaton
    ],
    'PL': [
        '52.229676,21.012229',  # Warsaw
        '50.064650,19.944980',  # Krakow
        '51.107883,17.038538',  # Wroclaw
        '53.428544,14.552812',  # Szczecin
        '51.759249,19.455983',  # Lodz
        '52.406374,16.925168',  # Poznan
        '53.013790,18.598444',  # Torun
        '54.352025,18.646638',  # Gdansk
        '50.286264,18.670850',  # Gliwice
        '53.132489,23.168840',  # Bialystok
        '50.866077,20.628568',  # Kielce
        '50.061947,22.002016',  # Przemyśl
        '51.935621,15.506186'  # Zielona Góra
    ],
    'NL': [
        '52.367573,4.904139',  # Amsterdam
        '51.9225,4.47917',  # Rotterdam
        '52.078663,4.288788',  # The Hague
        '50.850340,5.688889',  # Maastricht
        '52.090737,5.121420',  # Utrecht
        '51.571914,5.056642',  # Tilburg
        '51.812565,5.837226',  # Nijmegen
        '53.219384,6.566502',  # Groningen
        '51.441642,5.469722',  # Eindhoven
        '51.985103,5.898730',  # Arnhem
        '51.917415,4.484674',  # Dordrecht
        '52.201717,5.494264',  # Amersfoort
        '52.164840,5.387547'  # Zeist
    ],
    'AT': [  # Австрия
        '48.208174,16.373819',  # Vienna
        '47.809490,13.055010',  # Salzburg
        '47.070714,15.439504',  # Graz
        '48.306940,14.285830',  # Linz
        '47.516231,14.550072',  # Sankt Pölten
        '48.299439,14.290570',  # Wels
        '47.263090,11.399840',  # Innsbruck
        '46.624722,14.305278',  # Klagenfurt
        '48.775848,15.603028',  # Krems an der Donau
        '47.397640,9.741925',  # Bregenz
        '47.253603,13.002500',  # Zell am See
        '48.196640,16.369423',  # Schwechat
        '47.804370,13.048790'  # Hallein
    ],
    'DK': [  # Дания
        '55.676098,12.568337',  # Copenhagen
        '56.162939,10.203921',  # Aarhus
        '55.403756,10.402370',  # Odense
        '55.490140,8.451880',  # Esbjerg
        '57.048820,9.921747',  # Aalborg
        '55.061430,10.603010',  # Svendborg
        '54.913876,9.792022',  # Padborg
        '55.712320,9.536630',  # Vejle
        '55.229160,11.759820',  # Nakskov
        '55.676098,12.568337',  # Copenhagen (повтор для разнообразия)
        '55.990400,9.580490',  # Horsens
        '56.452000,9.412000',  # Viborg
        '56.149627,8.986963'  # Silkeborg
    ],
    'UA': [
        '50.450001,30.523333',  # Киев
        '49.839683,24.029717',  # Львов
        '46.482526,30.723309',  # Одесса
        '48.922633,24.709722',  # Ивано-Франковск
        '49.588267,34.551416',  # Полтава
        '48.619572,22.288238',  # Ужгород
        '48.464717,35.046183',  # Днепр
        '50.259014,28.676396',  # Житомир
        '46.965910,31.997400',  # Николаев
        '49.993500,36.230383',  # Харьков
        '47.838800,35.139567',  # Запорожье
        '50.619900,26.251617',  # Ровно
        '50.907700,34.798100'  # Сумы
    ],
    'RO': [
        '44.426767,26.102538',  # Бухарест
        '46.770439,23.591423',  # Клуж-Напока
        '45.748871,21.208679',  # Тимишоара
        '47.156944,27.590278',  # Яссы
        '45.643728,25.588852',  # Брашов
        '47.659661,23.580611',  # Бая-Маре
        '46.574645,26.915466',  # Бакэу
        '45.953176,24.716385',  # Сибиу
        '44.330179,23.794880',  # Крайова
        '44.850000,24.866667'  # Рымнику-Вылча
    ],
    'EE': [
        '59.437000,24.753575',  # Таллин
        '58.378025,26.728493',  # Тарту
        '59.396563,27.273538',  # Нарва
        '58.893267,25.565111',  # Вильянди
        '58.255676,22.491951',  # Курессааре
        '59.358889,24.659444',  # Маарду
        '59.475556,24.062778',  # Кейла
        '59.193056,28.208056',  # Силламяэ
        '58.938889,23.540000',  # Хаапсалу
        '58.906666,24.449444'  # Раквере
    ],
    'LV': [
        '56.949649,24.105186',  # Рига
        '56.504667,21.010806',  # Лиепая
        '55.879291,26.505980',  # Даугавпилс
        '56.652778,25.253611',  # Валмиера
        '56.512500,27.327500',  # Лудза
        '56.655444,23.719444',  # Елгава
        '57.539444,24.365556',  # Сигулда
        '56.605000,22.961667',  # Вентспилс
        '56.506944,22.981667',  # Салдус
        '57.542500,25.426667'  # Цесис
    ],
    'LT': [
        '54.687157,25.279652',  # Вильнюс
        '55.703297,21.144280',  # Клайпеда
        '55.896250,23.956400',  # Шяуляй
        '54.898520,23.903596',  # Каунас
        '55.072000,24.415450',  # Паневежис
        '55.093850,21.884770',  # Тельшяй
        '54.394950,24.045290',  # Алитус
        '55.916850,25.594460',  # Утена
        '55.528990,25.591420',  # Зарасай
        '54.380500,24.036560'  # Друскининкай
    ],
    'BG': [
        '42.697708,23.321868',  # София
        '43.214050,27.914733',  # Варна
        '42.135407,24.745290',  # Пловдив
        '42.505499,27.461905',  # Бургас
        '43.855499,25.973626',  # Русе
        '43.835571,25.948546',  # Велико-Тырново
        '41.577441,24.702163',  # Смолян
        '42.619415,25.393725',  # Казанлык
        '43.137091,24.716632',  # Ловеч
        '41.579155,23.282669'  # Банско
    ],
}

radius_data = {
    'ES': {
        'default': 30000,
        'border': 20000,
        'border_cities': [
            '40.970104,-5.663540',  # Salamanca
            '42.237964,-8.720244',  # Vigo
            '37.992240,-1.130654',  # Murcia
            '40.656635,-4.697438',  # Ávila
            '40.331950,-1.107018',  # Teruel
            '41.656060,-0.877340'  # Zaragoza
        ]
    },
    'DE': {
        'default': 30000,
        'border': 20000,
        'border_cities': [
            '50.775346,6.083887',  # Aachen
            '50.641200,10.121810',  # Eisenach
            '50.828710,8.773710'  # Marburg
        ]
    },
    'FR': {
        'default': 30000,
        'border': 20000,
        'border_cities': [
            '47.083354,2.398712',  # Bourges
            '47.322047,5.041480',  # Dijon
            '47.237829,6.024053'  # Besançon
        ]
    },
    'GB': {
        'default': 30000,
        'border': 20000,
        'border_cities': [
            '55.953251,-3.188267'  # Edinburgh
        ]
    },
    'PL': {
        'default': 30000,
        'border': 20000,
        'border_cities': [
            '53.428544,14.552812',  # Szczecin
            '53.132489,23.168840',  # Bialystok
            '51.935621,15.506186'  # Zielona Góra
        ]
    },
    'NL': {
        'default': 30000,
        'border': 20000,
        'border_cities': [
            '50.850340,5.688889'  # Maastricht
        ]
    },
    'AT': {  # Австрия
        'default': 30000,
        'border': 20000,
        'border_cities': [
            '47.070714,15.439504',  # Graz
            '47.516231,14.550072',  # Sankt Pölten
            '46.624722,14.305278',  # Klagenfurt
            '47.397640,9.741925'  # Bregenz
        ]
    },
    'DK': {  # Дания
        'default': 30000,
        'border': 20000,
        'border_cities': [
            '54.913876,9.792022',  # Padborg
            '55.490140,8.451880'  # Esbjerg
        ]
    },
    'UA': {
        'default': 30000,  # Стандартный радиус поиска (в метрах)
        'border': 20000,  # Радиус для пограничных городов (в метрах)
        'border_cities': [
            '49.839683,24.029717',  # Львов
            '48.619572,22.288238',  # Ужгород
            '50.259014,28.676396',  # Житомир
            '50.907700,34.798100'  # Сумы
        ]
    },
    'RO': {
        'default': 30000,
        'border': 20000,
        'border_cities': [
            '44.426767,26.102538',  # Бухарест
            '46.770439,23.591423',  # Клуж-Напока
            '45.748871,21.208679'  # Тимишоара
        ]
    },
    'EE': {
        'default': 30000,
        'border': 20000,
        'border_cities': [
            '59.437000,24.753575',  # Таллин
            '58.378025,26.728493',  # Тарту
            '59.396563,27.273538'  # Нарва
        ]
    },
    'LV': {
        'default': 30000,
        'border': 20000,
        'border_cities': [
            '56.949649,24.105186',  # Рига
            '56.504667,21.010806',  # Лиепая
            '55.879291,26.505980'  # Даугавпилс
        ]
    },
    'LT': {
        'default': 30000,
        'border': 20000,
        'border_cities': [
            '54.687157,25.279652',  # Вильнюс
            '55.896250,23.956400',  # Шяуляй
            '54.898520,23.903596'  # Каунас
        ]
    },
    'BG': {
        'default': 30000,
        'border': 20000,
        'border_cities': [
            '42.697708,23.321868',  # София
            '43.214050,27.914733',  # Варна
            '42.135407,24.745290'  # Пловдив
        ]
    },
}
